app/views/messages/create.json.jbuilder

  json.user_name  @message.user.name
  json.date  format_posted_time(@message.created_at)
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('aaaaaaaaaaaaaaaaa', 1, 1, '2018-06-09 07:33:13', '2018-06-09 07:33:13')